In [32]:
import pandas as pd
from pandas import DataFrame, Series

In [2]:
marks = {
    'Name': ['mehul', 'jane', 'jill'],
    'Roll': [10, 23, 11],
    'Physics': [99, 93, 87],
    'Chemistry': [93, 78, 90]
}

In [5]:
d1 = DataFrame(marks)
d1

    Name  Roll  Physics  Chemistry
0  mehul    10       99         93
1   jane    23       93         78
2   jill    11       87         90

In [7]:
print(d1.index)
print(d1.columns)

RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Roll', 'Physics', 'Chemistry'], dtype='object')

In [11]:
d2 = DataFrame(marks, index=marks['Roll'], columns=['Name', 'Physics', 'Chemistry'])
d2

     Name  Physics  Chemistry
10  mehul       99         93
23   jane       93         78
11   jill       87         90

In [17]:
# indexing rows
print(d2.loc[23])
print(d2.loc[[10, 11]])

# indexing cols
print(d2['Physics'])
print(d2[['Name', 'Chemistry']])

# indexing rows + cols
print(d2.loc[10, ['Physics', 'Chemistry']])
print(d2.loc[[10, 11], ['Name', 'Chemistry']])

Name         jane
Physics        93
Chemistry      78
Name: 23, dtype: object
     Name  Physics  Chemistry
10  mehul       99         93
11   jill       87         90
10    99
23    93
11    87
Name: Physics, dtype: int64
     Name  Chemistry
10  mehul         93
23   jane         78
11   jill         90
Physics      99
Chemistry    93
Name: 10, dtype: object
     Name  Chemistry
10  mehul         93
11   jill         90

In [21]:
# implict 0 based indices
print(d2)
print(d2.iloc[[0, -1]])
print(d2.iloc[[1, -1], [1, 2]])

     Name  Physics  Chemistry
10  mehul       99         93
23   jane       93         78
11   jill       87         90
     Name  Physics  Chemistry
10  mehul       99         93
11   jill       87         90
    Physics  Chemistry
23       93         78
11       87         90

In [26]:
# slicing
print(d2)

# row
print(d2.iloc[:2])
print(d2.iloc[-2:])

# column
print(d2.iloc[:, 1:])

     Name  Physics  Chemistry
10  mehul       99         93
23   jane       93         78
11   jill       87         90
     Name  Physics  Chemistry
10  mehul       99         93
23   jane       93         78
    Name  Physics  Chemistry
23  jane       93         78
11  jill       87         90
    Physics  Chemistry
10       99         93
23       93         78
11       87         90

In [30]:
# indexing + slicing
print(d2)
print(d2.iloc[:2, [0, -1]])
print(d2.loc[[10, 11], ['Name', 'Chemistry']])

     Name  Physics  Chemistry
10  mehul       99         93
23   jane       93         78
11   jill       87         90
     Name  Chemistry
10  mehul         93
23   jane         78
     Name  Chemistry
10  mehul         93
11   jill         90

In [33]:
print(d2)
maths_series = Series({11: 99, 10: 100, 23: 89})
print(maths_series)

     Name  Physics  Chemistry
10  mehul       99         93
23   jane       93         78
11   jill       87         90
11     99
10    100
23     89
dtype: int64

In [34]:
d2['Maths'] = maths_series

In [35]:
d2

     Name  Physics  Chemistry  Maths
10  mehul       99         93    100
23   jane       93         78     89
11   jill       87         90     99

In [36]:
d2['Total'] = d2['Physics'] + d2['Chemistry'] + d2['Maths']

In [37]:
d2

     Name  Physics  Chemistry  Maths  Total
10  mehul       99         93    100    292
23   jane       93         78     89    260
11   jill       87         90     99    276

In [40]:
d3 = d2.drop(columns=['Name', 'Total'])
d3

    Physics  Chemistry  Maths
10       99         93    100
23       93         78     89
11       87         90     99

In [42]:
print(d3.mean(axis=0))
print(d3.sum(axis=1))

Physics      93.0
Chemistry    87.0
Maths        96.0
dtype: float64
10    292
23    260
11    276
dtype: int64

In [43]:
d4 = DataFrame({
    'Verbal': [99, 95, 93],
    'Quant': [100, 67, 89]
}, index=[10, 11, 23])
d4

    Verbal  Quant
10      99    100
11      95     67
23      93     89

In [46]:
data = pd.merge(d2, d4, left_index=True, right_index=True)
data

     Name  Physics  Chemistry  Maths  Total  Verbal  Quant
10  mehul       99         93    100    292      99    100
23   jane       93         78     89    260      93     89
11   jill       87         90     99    276      95     67

In [47]:
data.sort_index()

     Name  Physics  Chemistry  Maths  Total  Verbal  Quant
10  mehul       99         93    100    292      99    100
11   jill       87         90     99    276      95     67
23   jane       93         78     89    260      93     89

In [48]:
data.sort_values(by='Chemistry')

     Name  Physics  Chemistry  Maths  Total  Verbal  Quant
23   jane       93         78     89    260      93     89
11   jill       87         90     99    276      95     67
10  mehul       99         93    100    292      99    100